[
   {
      "title": "Aislar el clúster de manera lógica",
      "priority": "Medium",
      "description": "El aislamiento lógico sirve para separar equipos y proyectos.  El objetivo es tener el mínimo de clústeres físicos que permitan el aislamiento adecuado de sus equipos o aplicaciones.",
      "documentation": [
        {
          "title": "Aislando el clúster",
          "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-cluster-isolation#logically-isolate-clusters"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Aislamiento físico del cluster",
      "priority": "High",
      "description": "Se recomienda minimizar el uso del aislamiento físico. En su lugar, se recomienda usar el aislamiento lógico para poder tener un máximo uso de los recursos del clúster.",
      "documentation": [
        {
          "title": "Aislando el clúster",
          "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-cluster-isolation#physically-isolate-clusters"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Rango de autorización de IP",
      "priority": "High",
      "description": "En Kubernetes, el servidor de API recibe solicitudes para realizar acciones en el clúster, como crear recursos o reducir el número de nodos. El servidor de API es la manera centralizada de interactuar con un clúster y administrarlo. Para mejorar la seguridad del clúster y minimizar los ataques, el servidor de API solo debe ser accesible desde un conjunto limitado de intervalos de direcciones IP. En este artículo se muestra cómo usar los intervalos IP autorizados por el servidor de API para limitar qué direcciones IP y CIDR pueden acceder al plano de control.",
      "documentation": [
        {
          "title": "Protección del acceso al servidor de API con intervalos de direcciones IP autorizadas en Azure Kubernetes Service (AKS)",
          "url": "https://docs.microsoft.com/es-es/azure/aks/api-server-authorized-ip-ranges"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "Integración con AAD",
      "priority": "High",
      "description": "Es posible configurar Azure Kubernetes Service (AKS) para que utilice Azure Active Directory (Azure AD) para la autenticación de usuarios. En esta configuración, puede iniciar sesión en un clúster de AKS mediante su token de autenticación de Azure AD.",
      "documentation": [
        {
          "title": "Integración de Azure Active Directory con Azure Kubernetes Service",
          "url": "https://docs.microsoft.com/es-es/azure/aks/azure-ad-integration"
        },
        {
          "title": "Integración de Azure AD en Azure Kubernetes Service (versión preliminar) V2",
          "url": "https://docs.microsoft.com/es-es/azure/aks/azure-ad-v2"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "Clústeres Privados",
      "priority": "High",
      "description": "En un clúster privado, el servidor de la API o el plano de control tienen direcciones IP internas que se definen en el documento RFC1918 sobre la asignación de direcciones para conexiones privadas. Mediante el uso de un clúster privado, puede asegurarse de que el tráfico entre el servidor de la API y los grupos de nodos permanece solo en la red privada. El plano de control o el servidor de la API están en una suscripción de Azure administrada mediante Azure Kubernetes Service (AKS). El grupo de clústeres o nodos de un cliente está en la suscripción del cliente. El servidor y el grupo de clústeres o nodos pueden comunicarse entre sí a través del servicio de Azure Private Link en la red virtual del servidor de la API y de un punto de conexión privado expuesto en la subred del clúster de AKS del cliente.",
      "documentation": [
        {
          "title": "Creación de un clúster privado de Azure Kubernetes Service",
          "url": "https://docs.microsoft.com/es-es/azure/aks/private-clusters"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "Habilitar autoescalado en el clúster",
      "priority": "Medium",
      "description": "Para satisfacer las necesidades de la aplicación en Azure Kubernetes Service (AKS), es posible que deba ajustar el número de nodos que ejecutan las cargas de trabajo. El componente de escalado automático de clústeres puede supervisar los pods del clúster que no pueden programarse debido a las restricciones de los recursos. Cuando se detectan problemas, la cantidad de nodos de un grupo de nodos aumenta para satisfacer las necesidades de la aplicación. Asimismo, los nodos también se comprueban regularmente para detectar la falta de pods en ejecución y, en consecuencia, la cantidad de nodos se reduce según sea necesario. Esta capacidad de ampliar o reducir automáticamente la cantidad de nodos en su clúster de AKS le permite ejecutar un clúster de forma eficaz y rentable.",
      "details": "Puede habilitar el módulo de autoescalado por nodepool del clúster, pero sólo puede crear un perfil de autoescalado.",
      "documentation": [
        {
          "title": "Autoescalado en AKS",
          "url": "https://docs.microsoft.com/es-es/azure/aks/cluster-autoscaler"
        }
      ],
      "tags": ["all", "resources"]
    },
    {
      "title": "Refrescar el contenedor cuando su imagen base es actualizada",
      "priority": "Medium",
      "description": "A medida que desarrolla y ejecuta aplicaciones en Azure Kubernetes Service (AKS), es importante tener en cuenta la seguridad de los contenedores y de sus imágenes. Los contenedores que incluyen imágenes base obsoletas o entornos de ejecución de la aplicación sin revisiones presentan un riesgo de seguridad y un posible vector de ataque. Para minimizar estos riesgos, debe integrar herramientas que busquen y corrijan errores en los contenedores tanto en el momento de la compilación como en el momento de la ejecución. Cuanto más temprano en el proceso se detecte la vulnerabilidad o la imagen de base desactualizada, más seguro será el clúster. En este artículo, contenedores se refiere tanto a las imágenes de contenedor almacenadas en un registro de contenedor como a los contenedores en ejecución.",
      "documentation": [
        {
          "title": "Compilar automáticamente nuevas imágenes en la actualización de imagen base",
          "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-container-image-management#automatically-build-new-images-on-base-image-update"
        },
        {
          "title": "Azure DevOps - Ejecutar pipeline para actualización de imágenes Docker",
          "url": "https://dev.to/larryclaman/trigger-azure-devops-build-pipeline-from-docker-image-update-5d3i"
        }
      ],
      "tags": ["all", "resources"]
    }
] 