[
  {
    "title": "Implementar una prueba de Liveness",
    "priority": "High",
    "description": "Muchas aplicaciones que están corriendo por largos períodos de tiempo, eventualmente hace una transición a un estado fallido y no se pueden recuperar a menos que se reinicien. Kubernetes provee pruebas de “liveness” que detectan tales casos y reinician los contenedores. La prueba es usada para decirle a Kubernetes cuando debe reiniciar el pod cuando este ya no está respondiendo.",
    "documentation": [
      {
        "title": "Configurara pruebas de  Liveness y Readiness",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Implementar una prueba de Readiness",
    "priority": "Medium",
    "description": "A veces algunas aplicaciones se encuentran no disponibles para servir tráfico. Por ejemplo, una aplicación puede necesitar hacer una carga de datos grande o configurar un archivo al arranque, o depende de servicios externos para arrancar. En tales casos, uno no necesita eliminar la aplicación, pero tampoco desea enviarle peticiones en ese estado. Kubernetes provee pruebas de “readiness” para detectar y mitigar estos casos. Un pod con contenedores reportando que no esta listo no recibirá tráfico de los servicios de Kubernetes.",
    "documentation": [
      {
        "title": "Configurar pruebas de Liveness y Readiness",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Implementar un hook para el estado previo a la finalización",
    "priority": "Low",
    "description": "Este hook es llamado inmediatamente antes de que un contenedor sea terminado debido a una petición de una API o un evento de tipo falla en una prueba de “liveness”, preempción, contención de recursos u otros. Puede ser usado cuando el proceso crítico que se desea terminar o guardar, es terminado por alguna razón.",
    "documentation": [
      {
        "title": "Hooks del ciclo de vida de un contenedor",
        "url": "https://kubernetes.io/docs/concepts/containers/container-lifecycle-hooks/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Correr más de una replica de su Deployment",
    "priority": "Medium",
    "description": "Asegurarse que su aplicación siempre tenga un número suficiente de replicas para asegurar la resiliencia.",
    "tags": ["all", "development"]
  },
  {
    "title": "Aplicar etiquetas a todos los recursos",
    "priority": "Medium",
    "description": "Asegurar que todos los componentes estén debidamente etiquetados, pueden ser etiquetas de negocio, seguridad o etiquetas técnicas y que estas sirvan para poder aplicar políticas relevantes.",
    "tags": ["all", "development"]
  },
  {
    "title": "Implementar el auto escalado de sus aplicaciones ",
    "priority": "Low",
    "description": "El auto escalador horizontal de Pods (HPA) permite escalar el número de pods basado en la observación de utilización de CPU",
    "documentation": [
      {
        "title": "Escalador horizontal de Pods (HPA) ",
        "url": "https://kubernetes.io/docs/tasks/run-application/horizontal-pod-autoscale/"
      }
    ],
    "tags": ["all", "resiliency"]
  },
  {
    "title": "Almacenar sus secretos en Azure Keyvault",
    "priority": "Medium",
    "description": "Los secretos no están encriptados en etcd, prefiera almacenar los secretos en servicios de HSM como Azure Keyvault. Podrá inyectar estos secretos a través del uso de FlexVolume.",
    "documentation": [
      {
        "title": "Azure Key Vault Provider for Secret Store CSI Driver",
        "url": "https://github.com/Azure/secrets-store-csi-driver-provider-azure"
      },
      {
        "title": "Keyvault and flex volumes (Deprecated)",
        "url": "https://github.com/Azure/kubernetes-keyvault-flexvol"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Implementa identidades de Pod",
    "priority": "Medium",
    "description": "No use credenciales fijas dentro de pods o imágenes de contenedor, ya que corren riesgo de exposición o abuso. En su lugar, use identidades de pod para solicitar acceso automáticamente mediante una solución central de identidades de Azure AD. Las identidades de pod está pensadas para usar únicamente con pods de Linux y las imágenes de contenedor.Cuando los pods necesitan obtener acceso a otros servicios de Azure, como Cosmos DB, Key Vault o Blob Storage, el pod necesita credenciales de acceso. Estas credenciales de acceso pueden definirse con la imagen de contenedor o insertadas como un secreto de Kubernetes, pero es necesario crearlas y asignarlas manualmente. A menudo, las credenciales se reutilizan en los pods y no se rotan de forma periódica.",
    "documentation": [
      {
        "title": "Uso de identidades de pod",
        "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-identity#use-pod-identities"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Use los namespaces de Kubernetes para aislar apropiadamente los recursos",
    "priority": "Medium",
    "description": "Los namespaces le dan la abilidad de crear particiones lógicas y reforzar la separación de recursos, así como el alcance y limites de los permisos de usuarios. Recuerde no utilizar el namespace Default",
    "documentation": [
      {
        "title": "Namespaces",
        "url": "https://kubernetes.io/docs/concepts/overview/working-with-objects/namespaces/"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Defina limites para sus contenedores",
    "priority": "High",
    "description": "Cuando los recursos requeridos por los contenedores son especificados, el scheduler de Kubernetes puede tomar mejores decisiones sobre en que nodos posicionar los pods. Cuando los contenedores tienen sus limites especificados, la contención de recursos en un nodo puede ser administrado de mejor manera.",
    "documentation": [
      {
        "title": "Administrando los recursos de computo de los contenedores",
        "url": "https://kubernetes.io/docs/concepts/configuration/manage-compute-resources-container/"
      }
    ],
    "tags": ["all", "resources"]
  }
]