[
      {
        "title": "Asegúrese de poder realizar un despliegue de tipo Whitespace",
        "priority": "High",
        "description": "Un despliegue de tipo whitespace o greenfield, se refiere al ejercicio de eliminar todo y redesplegar la plataforma completa de manera automatizada.",
        "details": "En caso de una emergencia, una falla de seguridad o una falla en el datacenter, se recomienda poder ser capaz crear/restaurar un ambiente nuevo, configurado correctamente de manera automatizada",
        "tags": ["all","devops"]
      },
      {
        "title": "Usar availability zones",
        "priority": "High",
        "description": "Un clúster de Azure Kubernetes Service (AKS) distribuye recursos como los nodos y el almacenamiento en secciones lógicas de la infraestructura de procesos subyacente de Azure. Este modelo de implementación garantiza que los nodos se ejecuten en dominios de actualización y error separados en un solo centro de datos de Azure. Los clústeres de AKS implementados con este comportamiento predeterminado proporcionan un alto nivel de disponibilidad para protegerle contra un error de hardware o un evento de mantenimiento planeado.",
        "documentation": [
          {
            "title": "Crear un clúster de AKS en zonas de disponibilidad",
            "url": "https://docs.microsoft.com/es-es/azure/aks/availability-zones#create-an-aks-cluster-across-availability-zones"
          }
        ],
        "tags": ["all", "resiliency"]
      },
      {
        "title": "Planifique para despliegues multi-región",
        "priority": "Medium",
        "description": "Al implementar varios clústeres de AKS, elija las regiones donde AKS está disponible y use regiones emparejadas.",
        "documentation": [
          {
            "title": "Planeamiento de la implementación en varias regiones",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-multi-region#plan-for-multiregion-deployment"
          }
        ],
        "tags": ["all", "resiliency"]
      },
      {
        "title": "Use el Azure Traffic Manager para dirigir tráfico",
        "priority": "Low",
        "description": "Azure Traffic Manager puede dirigir a los clientes a la instancia de la aplicación y los clústeres de AKS más próxima. Para conseguir los máximos niveles de rendimiento y redundancia, dirija todo el tráfico de la aplicación con Traffic Manager antes de que pase al clúster de AKS.",
        "documentation": [
          {
            "title": "Uso de Azure Traffic Manager para enrutar el tráfico",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-multi-region#use-azure-traffic-manager-to-route-traffic"
          }
        ],
        "tags": ["all", "resiliency","networking"]
      },
      {
        "title": "Cree una estrategia de migración de almacenamiento",
        "priority": "Low",
        "description": "Sus aplicaciones pueden usar Azure Storage para almacenar data. Debido a que sus aplicaciones están distribuidas en múltiples clústeres en diferentes regiones, se debe mantener el almacenamiento sincronizado.",
        "documentation": [
          {
            "title": "Crear un plan de migración de almacenamiento",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-multi-region#create-a-storage-migration-plan"
          },
          {
            "title": "Respaldo, restauración y migración de recursos de Kubernetes incluyendo estado hacia otro clúster de AKS usando Velero",
            "url": "https://pumpingco.de/blog/backup-and-restore-a-kubernetes-cluster-with-state-using-velero/"
          }
        ],
        "tags": ["all", "resiliency","storage"]
      }
]
