[
  {
    "title": "Aplique cuotas de recursos",
    "priority": "Low",
    "description": "Planeación y aplicación de cuotas de recursos a nivel de espacio de nombres. Si los pods no definen solicitudes y límites de recursos, rechace la implementación. Supervise el uso de recursos y ajuste las cuotas según sea necesario.",
    "details": "Las solicitudes y límites de recursos se colocan en la especificación de pod. Estos límites se usan por el programador de Kubernetes en el momento de la implementación para buscar un nodo disponible en el clúster. Estos límites y las solicitudes funcionan en el nivel de pod individual. Para obtener más información sobre cómo definir estos valores, vea Definición de los límites y solicitudes de recursos del pod.",
    "documentation": [
      {
        "title": "Aplique cuotas de recursos",
        "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-scheduler#enforce-resource-quotas"
      },
      {
        "title": "Cuotas de recursos",
        "url": "https://kubernetes.io/docs/concepts/policy/resource-quotas/"
      }
    ],
    "tags": ["all", "resiliency"]
  },
  {
    "title": "Defina limites de memoria y cpu para sus contenedores",
    "priority": "Medium",
    "description": "Defina limits y requests de CPU y memoria para todos sus contenedores. Esto previene filtrado de memoria y sobreuso de CPU además de proteger toda la plataforma.",
    "details": "Cuando especifica limites a la memoria y CPU, cada uno toma una acción diferente cuando alcanza el limite especificado. Con los limites de CPU, el contenedor es denegado de usar más de lo que se especifico en el limite. Con los limites de memoria, el pod es reiniciado si este alcanza el limite. El pod podría ser reiniciado en el mismo nodo o en un nodo diferente dentro del clúster.",
    "documentation": [
      {
        "title": "Asigne recursos de memoria a los contenedores",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/assign-memory-resource/"
      }
    ],
    "tags": ["all", "resiliency"]
  },
  {
    "title": "Configure presupuestos de interrupciones de pods",
    "priority": "Low",
    "description": "Para mantener la disponibilidad de las aplicaciones, defina presupuestos de interrupciones de pods para asegurarse de que haya un número mínimo de pods disponible en el clúster.",
    "details": "para mantener la disponibilidad de las aplicaciones, defina presupuestos de interrupciones de pods para asegurarse de que haya un número mínimo de pods disponible en el clúster: involuntarias y voluntarias. Las interrupciones involuntarias son eventos más allá del control típico del operador del clúster o el propietario de la aplicación. Estas interrupciones involuntarias incluyen un error de hardware en el equipo físico, una alerta de pánico de kernel o la eliminación de una máquina virtual del nodo. Las interrupciones voluntarias son eventos solicitados por el operador del clúster o el propietario de la aplicación. Estas interrupciones voluntarias incluyen actualizaciones del clúster, la actualización de una plantilla de implementación o la eliminación accidental de un pod.",
    "documentation": [
      {
        "title": "Planeación de disponibilidad mediante presupuestos de interrupciones de pods",
        "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-scheduler#plan-for-availability-using-pod-disruption-budgets"
      },
      {
        "title": "Especifique un presupuesto de interrupción para su aplicación",
        "url":"https://kubernetes.io/docs/tasks/run-application/configure-pdb/"
      }
    ],
    "tags": ["all", "resiliency"]
  },
  {
    "title": "Habilitar autoescalado en el clúster",
    "priority": "Low",
    "description": "Para satisfacer las necesidades de la aplicación en Azure Kubernetes Service (AKS), es posible que deba ajustar el número de nodos que ejecutan las cargas de trabajo. El componente de escalado automático de clústeres puede supervisar los pods del clúster que no pueden programarse debido a las restricciones de los recursos. Cuando se detectan problemas, la cantidad de nodos de un grupo de nodos aumenta para satisfacer las necesidades de la aplicación. Asimismo, los nodos también se comprueban regularmente para detectar la falta de pods en ejecución y, en consecuencia, la cantidad de nodos se reduce según sea necesario. Esta capacidad de ampliar o reducir automáticamente la cantidad de nodos en su clúster de AKS le permite ejecutar un clúster de forma eficaz y rentable.",
    "documentation": [
      {
        "title": "Autoescalado en AKS",
        "url": "https://docs.microsoft.com/es-es/azure/aks/cluster-autoscaler"
      }
    ],
    "tags": ["all", "resiliency"]
  }
]