[
  {
    "title": "Elección del tipo de almacenamiento adecuado",
    "priority": "High",
    "description": "Comprenda las necesidades de la aplicación para seleccionar el almacenamiento correcto. Utilice almacenamiento de alto rendimiento respaldado por SSD para cargas de trabajo de producción. Planee el almacenamiento basado en red cuando se necesiten varias conexiones simultáneas.",
    "documentation": [
      {
        "title": "Elección del tipo de almacenamiento adecuado",
        "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-storage#choose-the-appropriate-storage-type"
      }
    ],
    "tags": ["all", "storage"]
  },
    {
        "title": "Cambiar el tamaño de los nodos según las necesidades de almacenamiento",
        "priority": "Medium",
        "description": "Cada tamaño de nodo es compatible con un número máximo de discos. Los diferentes tamaños de nodos también proporcionan distintas cantidades de almacenamiento local y de ancho de banda de red. Planee las demandas dde las aplicaciones para implementar el tamaño adecuado de los nodos.",
        "detail": "Los nodos de AKS se ejecutan como VM de Azure. Existen distintos tipos y tamaños de VM disponibles. Cada tamaño de VM proporciona una cantidad diferente de recursos principales, como CPU y memoria. Estos tamaños de VM tienen un número máximo de discos que se pueden conectar. El rendimiento del almacenamiento también varía en función de los tamaños de VM para el IOPS (operaciones de entrada/salida por segundo) máximo de discos conectados y locales.",
        "documentation": [
          {
            "title": "Cambiar el tamaño de los nodos según las necesidades de almacenamiento",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-storage#size-the-nodes-for-storage-needs"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Aprovisionar volúmenes dinámicamente",
        "priority": "Low",
        "description": "Para reducir la sobrecarga de administración y escalar, no cree ni asigne estáticamente volúmenes persistentes. Use el aprovisionamiento dinámico. En las clases de almacenamiento, defina la directiva de reclamación adecuada para reducir los costos de almacenamiento innecesarios una vez que se eliminan los pods.",
        "documentation": [
          {
            "title": "Aprovisionar volúmenes dinámicamente",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-storage#dynamically-provision-volumes"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Proteja y realice una copia de seguridad de los datos",
        "priority": "Medium",
        "description": "Realice una copia de seguridad de los datos con una herramienta apropiada para su tipo de almacenamiento, como Velero o Azure Site Recovery. Compruebe la integridad y seguridad de las copias de seguridad.",
        "detail": "Comprenda las limitaciones de los diferentes enfoques de las copias de seguridad de datos y si necesita dejar sus datos en reposo antes de la instantánea. Las copias de seguridad de datos no necesariamente le permiten restaurar el entorno de la aplicación de la implementación del clúster. Para más información acerca de estos escenarios, consulte Procedimientos recomendados para continuidad empresarial y recuperación ante desastres en AKS.",
        "documentation": [
          {
            "title": "Proteja y realice una copia de seguridad de los datos",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-storage#secure-and-back-up-your-data"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      },
      {
        "title": "Persistir el estado de la aplicación fuera de los contenedores",
        "priority": "High",
        "description": "Cuando sea posible, no almacene el estado de servicio dentro del contenedor. En su lugar, use una plataforma de Azure como servicio (PaaS) que admita la replicación en varias regiones.",
        "detail": "Estado de servicio hace referencia a los datos en memoria o en disco que el servicio necesita para funcionar. El estado incluye las variables de miembro y las estructuras de datos que el servicio lee y escribe. Según el diseño del servicio, el estado también puede incluir archivos u otros recursos que se almacenan en el disco. Por ejemplo, el estado podría incluir los archivos que una base de datos usa para almacenar los registros de transacciones y de datos.",
        "documentation": [
          {
            "title": "Quitar el estado de servicio de dentro de los contenedores",
            "url": "https://docs.microsoft.com/es-es/azure/aks/operator-best-practices-multi-region#remove-service-state-from-inside-containers"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      }
]