[
    {
      "title": "Choose the appropriate network model",
      "priority": "Medium",
      "description": "For integration with existing virtual networks or on-premises networks, use Azure CNI networking in AKS. This network model also allows greater separation of resources and controls in an enterprise environment but be aware of the impact on the network topology/IP ranges",
      "detail":"While Kubenet is the default kubernetes network plugin, the Container Networking Interface (CNI) is a vendor-neutral protocol that lets the container runtime make requests to a network provider. The Azure CNI assigns IP addresses to pods and nodes, and provides IP address management (IPAM) features as you connect to existing Azure virtual networks. Each node and pod resource receives an IP address in the Azure virtual network, and no additional routing is needed to communicate with other resources or services.",
      "documentation": [
        {
          "title": "Kubenet vs CNI",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-network#choose-the-appropriate-network-model"
        }
      ],
      "tags": ["all", "network", "traffic"]
    },
    {
      "title": "Distribute ingress traffic",
      "priority": "Medium",
      "description": "To distribute HTTP or HTTPS traffic to your applications, use ingress resources and controllers. Ingress controllers provide additional features over a regular Azure load balancer, and can be managed as native Kubernetes resources.",
      "documentation": [
        {
          "title": "Secure access to the API server using authorized IP address ranges",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-network#distribute-ingress-traffic"
        }
      ],
      "tags": ["all", "network", "traffic"]
    },
    {
      "title": "Secure your exposed applications with a web application firewall (WAF)",
      "priority": "Medium",
      "description": "If you plan to host exposed applications, to scan incoming traffic for potential attacks, use a web application firewall (WAF) such as Barracuda WAF for Azure or Azure Application Gateway. These more advanced network resources can also route traffic beyond just HTTP and HTTPS connections or basic SSL termination.",
      "documentation": [
        {
          "title": "Secure traffic with a web application firewall (WAF)",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-network#secure-traffic-with-a-web-application-firewall-waf"
        }
      ],
      "tags": ["all", "network", "traffic"]
    },
    {
      "title": "Control traffic flow with network policies",
      "priority": "Medium",
      "description": "Use network policies to allow or deny traffic to pods. By default, all traffic is allowed between pods within a cluster. For improved security, define rules that limit pod communication.",
      "detail":"Network policy is a Kubernetes feature that lets you control the traffic flow between pods. You can choose to allow or deny traffic based on settings such as assigned labels, namespace, or traffic port. The use of network policies gives a cloud-native way to control the flow of traffic. As pods are dynamically created in an AKS cluster, the required network policies can be automatically applied. Don't use Azure network security groups to control pod-to-pod traffic, use network policies.",
      "documentation": [
        {
          "title": "Control traffic flow with network policies",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-network#control-traffic-flow-with-network-policies"
        }
      ],
      "tags": ["all", "network", "traffic"]
    },
    {
      "title": "Configure default network policies in each namespace",
      "priority": "Medium",
      "description": "Start by creating a deny all policy in each namespace and then add specific policies.",
      "documentation": [
        {
          "title": "Reciptes of best default network policies",
          "url": "https://github.com/ahmetb/kubernetes-network-policy-recipes"
        }
      ],
      "tags": ["all", "network", "traffic"]
    },
    {
      "title": "Prevent data-leaking with egress lockdown",
      "priority": "Medium",
      "description": "Use Azure Firewall to secure and control all egress traffic going outside of the cluster.",
      "documentation": [
        {
          "title": "Egress traffic requirements",
          "url": "https://docs.microsoft.com/en-us/azure/aks/limit-egress-traffic"
        }
      ],
      "tags": ["all", "network", "security"]
    }
]