[
  {
    "title": "Choose the right storage type",
    "priority": "High",
    "description": "Understand the needs of your application to pick the right storage. Use high performance, SSD-backed storage for production workloads. Plan for network-based storage when there is a need for multiple concurrent connections.",
    "documentation": [
      {
        "title": "Choose the right storage type",
        "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-storage#choose-the-appropriate-storage-type"
      }
    ],
    "tags": ["all", "storage"]
  },
    {
        "title": "Size the nodes for storage needs",
        "priority": "Medium",
        "description": "Each node size supports a maximum number of disks. Different node sizes also provide different amounts of local storage and network bandwidth. Plan for your application demands to deploy the appropriate size of nodes.",
        "detail": "Different types and sizes of nodes are available. Each node (underlying VM) size provides a different amount of core resources such as CPU and memory. These VM sizes have a maximum number of disks that can be attached. Storage performance also varies between VM sizes for the maximum local and attached disk IOPS (input/output operations per second). If your applications require Azure Disks as their storage solution, plan for and choose an appropriate node VM size. The amount of CPU and memory isn't the only factor when you choose a VM size. The storage capabilities are also important.",
        "documentation": [
          {
            "title": "Size the nodes for storage needs",
            "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-storage#size-the-nodes-for-storage-needs"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Dynamically provision volumes",
        "priority": "Low",
        "description": "To reduce management overhead and let you scale, don't statically create and assign persistent volumes. Use dynamic provisioning. In your storage classes, define the appropriate reclaim policy to minimize unneeded storage costs once pods are deleted.",
        "documentation": [
          {
            "title": "Dynamically provision volumes",
            "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-storage#dynamically-provision-volumes"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Secure and back up your data",
        "priority": "Medium",
        "description": "Back up your data using an appropriate tool for your storage type, such as Velero or Azure Site Recovery",
        "detail": "Understand the limitations of the different approaches to data backups and if you need to quiesce your data prior to snapshot. Data backups don't necessarily let you restore your application environment of cluster deployment.",
        "documentation": [
          {
            "title": "Secure and back up your data",
            "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-storage#secure-and-back-up-your-data"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      },
      {
        "title": "Make your storage resilient",
        "priority": "High",
        "description": "Where possible, don't store service state inside the container. Instead, use an Azure platform as a service (PaaS) that supports multiregion replication.",
        "detail": "Service state refers to the in-memory or on-disk data that a service requires to function. State includes the data structures and member variables that the service reads and writes. Depending on how the service is architected, the state might also include files or other resources that are stored on the disk. For example, the state might include the files a database uses to store data and transaction logs.",
        "documentation": [
          {
            "title": "Remove service state from inside containers",
            "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-multi-region#remove-service-state-from-inside-containers"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      }
]