[
   {
      "title": "Logically isolate cluster",
      "priority": "Medium",
      "description": "Use logical isolation to separate teams and projects. Try to minimize the number of physical AKS clusters you deploy to isolate teams or applications",
      "documentation": [
        {
          "title": "Isolating cluster",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-cluster-isolation#logically-isolate-clusters"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Physically isolate cluster",
      "priority": "High",
      "description": "Minimize the use of physical isolation for each separate team or application deployment",
      "documentation": [
        {
          "title": "Isolating cluster",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-cluster-isolation#physically-isolate-clusters"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "IP Range authorization",
      "priority": "High",
      "description": "The API server is the central way to interact with and manage a cluster. To improve cluster security and minimize attacks, the API server should only be accessible from a limited set of IP address ranges.By using a private cluster, you can ensure that network traffic between your API server and your node pools remains on the private network only. Because the API server has a private address, it means that to access it for administration or for deployment, you need to set up a private connection, like using a 'jumpbox' (i.e.: Azure Bastion)",
      "documentation": [
        {
          "title": "Secure access to the API server using authorized IP address ranges",
          "url": "https://docs.microsoft.com/en-us/azure/aks/api-server-authorized-ip-ranges"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "AAD Integration",
      "priority": "High",
      "description": "Azure Kubernetes Service (AKS) can be configured to use Azure Active Directory (Azure AD) for user authentication. In this configuration, you can sign in to an AKS cluster by using your Azure AD authentication token.",
      "documentation": [
        {
          "title": "Integrate Azure Active Directory with Azure Kubernetes Service",
          "url": "https://docs.microsoft.com/en-us/azure/aks/azure-ad-integration"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "Private cluster",
      "priority": "High",
      "description": "In a private cluster, the control plane or API server has internal IP addresses and is not exposed to Internet",
      "detail": "By using a private cluster, you can ensure that network traffic between your API server and your node pools remains on the private network only. Because the API server has a private address, it means that to access it for administration or for deployment, you need to set up private connection, like using a 'jumpbox' (i.e.: Azure Bastion)",
      "documentation": [
        {
          "title": "Create a private cluster",
          "url": "https://docs.microsoft.com/en-us/azure/aks/private-clusters"
        }
      ],
      "tags": ["all", "security"]
    },
    {
      "title": "Enable cluster autoscaling",
      "priority": "Medium",
      "description": "To keep up with application demands in Azure Kubernetes Service (AKS), you may need to adjust the number of nodes that run your workloads. The cluster autoscaler component can watch for pods in your cluster that can't be scheduled because of resource constraints.",
      "details":"You can enable autoscaling module per node pool but only create one mutual autoscale profile",
      "documentation": [
        {
          "title": "AKS Autoscaler",
          "url": "https://docs.microsoft.com/en-us/azure/aks/cluster-autoscaler"
        }
      ],
      "tags": ["all", "resources"]
    },
    {
      "title": "Refresh container when base image is updated",
      "priority": "Medium",
      "description": "As you use base images for application images, use automation to build new images when the base image is updated. As those base images typically include security fixes, update any downstream application container images.",
      "documentation": [
        {
          "title": "Automatically build new images on base image update",
          "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-container-image-management#automatically-build-new-images-on-base-image-update"
        },
        {
          "title": "Azure DevOps - Trigger pipeline from Docker image update",
          "url": "https://dev.to/larryclaman/trigger-azure-devops-build-pipeline-from-docker-image-update-5d3i"
        }
      ],
      "tags": ["all", "resources"]
    }
] 