[
  {
    "title": "Implémentez une sonde Live",
    "priority": "High",
    "description": "De nombreuses applications exécutées pendant de longues périodes finissent par passer à des états défectueux et ne peuvent pas récupérer, sauf en étant redémarrées. Kubernetes fournit des sondes de vivacité pour détecter et remédier à de telles situations. La sonde est là pour dire à Kubernetes de redémarrer votre pod quand il ne répond plus",
    "documentation": [
      {
        "title": "Configure Liveness, Readiness probes",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Implémentez une sonde de démarrage",
    "priority": "Medium",
    "description": "Protégez les conteneurs à démarrage lent avec des sondes de démarrage. Le problème de démarrage permet de retarder la vérification initiale par la vivacité, ce qui pourrait entraîner un blocage ou un mauvais résultat",
    "documentation": [
      {
        "title": "Configure Liveness, Readiness and Startup Probes",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Implémentez une sonde Ready",
    "priority": "Medium",
    "description": "Parfois, les applications sont temporairement incapables de gérer le trafic. Par exemple, une application peut avoir besoin de charger de gros fichiers de données ou de configuration lors du démarrage, ou dépendre de services externes après le démarrage. Dans de tels cas, vous ne voulez pas tuer l'application, mais vous ne voulez pas non plus lui envoyer de demandes. Kubernetes fournit des sondes de préparation pour détecter et atténuer ces situations. Un module contenant des conteneurs signalant qu'ils ne sont pas prêts ne reçoit pas de trafic via les services Kubernetes.",
    "documentation": [
      {
        "title": "Configure Liveness, Readiness probes",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Implémentez un hook prestop",
    "priority": "Low",
    "description": "Ce hook est appelé immédiatement lorsqu'un container est arrêté dû à une requête API ou un évênement de contrôle (échec d'une sonde), préemption, limitation de resource ou autre. Cela peut être utilisé lorsque vous avez des processus critiques que vous voulez voir terminer ou sauvegarder leur travail",
    "documentation": [
      {
        "title": "Hooks de cycle de vie de container",
        "url": "https://kubernetes.io/docs/concepts/containers/container-lifecycle-hooks/"
      }
    ],
    "tags": ["all", "development"]
  },
  {
    "title": "Appliquez plusieurs réplicas à vos déploiements",
    "priority": "Medium",
    "description": "Assurez que chacun de vos composants a plusieurs réplicas pour assurer sa résilience.",
    "tags": ["all", "development"]
  },
  {
    "title": "Appliquez des tags à toutes vos ressources",
    "priority": "Medium",
    "description": "Assurez-vous que vos composants sont taggués, cela peut être lié au business, à la sécurité ou technique, et ces tags serviront pour appliquer des politiques ou des contrôles.",
    "tags": ["all", "development"]
  },
  {
    "title": "Implémentez l'autoscaling sur vos applications",
    "priority": "Low",
    "description": "Le module d'autoscaling horizontal (HPA -Horizontal Pod Autoscaler) augmente et réduit automatiquement le nombre des pods en se basant sur la consommation CPU et mémoire de votre application",
    "documentation": [
      {
        "title": "Horizontal Pod Autoscaler",
        "url": "https://kubernetes.io/docs/tasks/run-application/horizontal-pod-autoscale/"
      }
    ],
    "tags": ["all", "resiliency"]
  },
  {
    "title": "Stockez vos secrets dans Azure Key Vault",
    "priority": "High",
    "description": "Les secrets ne sont pas chiffrés dans la base etcd, prefer to store your secrets in a proper HSM like Azure Key Vault. You can then inject secrets using FlexVolume.",
    "documentation": [
      {
        "title": "Azure Key Vault Provider for Secret Store CSI Driver)",
        "url": "https://github.com/Azure/secrets-store-csi-driver-provider-azure"
      },
      {
        "title": "Key Vault and flex volumes (Deprecated)",
        "url": "https://github.com/Azure/kubernetes-keyvault-flexvol"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Implémentez Pod Identity",
    "priority": "Medium",
    "description": "N'utilisez pas d'informations d'identification fixes dans les pods ou les images de conteneurs, car ils risquent d'être exposés ou abusés. Utilisez plutôt des identités de pod pour demander automatiquement l'accès à l'aide d'une solution d'identité Azure AD centrale",
    "detail": "Lorsque les pods ont besoin d'accéder à d'autres services Azure, tels que Cosmos DB, Key Vault ou Blob Storage, le pod a besoin d'informations d'identification d'accès. Ces informations d'identification d'accès peuvent être définies avec l'image du conteneur ou injectées en tant que secret Kubernetes, mais doivent être créées et attribuées manuellement. Souvent, les informations d'identification sont réutilisées sur plusieurs pods et ne sont pas régulièrement tournées. Les identités gérées pour les ressources Azure (actuellement implémentées en tant que projet open source AKS associé) vous permettent de demander automatiquement l'accès aux services via Azure AD. Vous ne définissez pas manuellement les informations d'identification pour les pods, ils demandent plutôt un jeton d'accès en temps réel et peuvent l'utiliser pour accéder uniquement aux services qui leur sont attribués.",
    "documentation": [
      {
        "title": "Utilisez pod identity",
        "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-identity#use-pod-identities"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Utilisez les espaces de noms de Kubernetes pour isoler vos ressources",
    "priority": "Medium",
    "description": "Les espaces de noms vous permettent de créer des partitions logiques et d'appliquer la séparation de vos ressources, ainsi que de limiter la portée des autorisations utilisateur. N'oubliez pas de ne pas utiliser l'espace de noms par défaut",
    "documentation": [
      {
        "title": "Namespaces",
        "url": "https://kubernetes.io/docs/concepts/overview/working-with-objects/namespaces/"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Définissez des demandes et limites (de ressources) sur vos containers",
    "priority": "High",
    "description": "Lorsque les containeurs ont des requêtes de ressources définies, le scheduler peut prendre des décisions optimisisés quant au noeud sur lesquels les déployer. Lorsque les containeurs ont des limites, Kuernetes peut alors contrôler les ressources allouées.",
    "documentation": [
      {
        "title": "Managing Compute Resources for Containers",
        "url": "https://kubernetes.io/docs/concepts/configuration/manage-compute-resources-container/"
      }
    ],
    "tags": ["all", "resources"]
  },
  {
    "title": "Spécifiez le contexte de sécurité de votre pod / conteneur",
    "priority": "Medium",
    "description": "Un contexte de sécurité définit les paramètres de privilège et de contrôle d'accès pour un pod ou un conteneur. Contrôlez les capacités et les droits que votre conteneur peut avoir",
    "documentation": [
      {
        "title": "Configure a Security Context for a Pod or Container",
        "url": "https://kubernetes.io/docs/tasks/configure-pod-container/security-context/"
      }
    ],
    "tags": ["all", "resources", "security"]
  },
  {
    "title": "Réaliser des constructions d'images Docker à l'aide des meilleures pratiques de sécurité des images Docker",
    "priority": "High",
    "description": "Définissez une base de référence de sécurité de build Image que vos développeurs doivent suivre. ",
    "documentation": [
      {
        "title": "SNYK 10 Docker Image Security Best Practices",
        "url": "https://snyk.io/blog/10-docker-image-security-best-practices/"
      }
    ],
    "tags": ["all", "security"]
},
{
    "title": "Analyse statique des images Docker lors de la construction",
    "priority": "High",
    "description": "Introduction de DevSecOps dans l'environnement pour promouvoir un modèle de sécurité proactif qui commence à transférer la responsabilité vers la gauche",
    "documentation": [
      {
        "title": "Palo Alto CI/CD Integration (twistcli)",
        "url": "https://docs.paloaltonetworks.com/prisma/prisma-cloud/prisma-cloud-admin-compute/tools/twistcli_scan_images"
      },
      {
        "title": "Aquasec CI/CD Integration",
        "url": "https://docs.aquasec.com/docs/image-scanning"
      },
      {
        "title": "Qualys CI/CD Integration",
        "url": "https://qualysguard.qg2.apps.qualys.com/cs/help/vuln_scans/docker_images.htm"
      },
      {
        "title": "StackRox CI/CD Integration",
        "url": "https://www.stackrox.com/use-cases/vulnerability-management/"
      },
      {
        "title": "Clair CI/CD Integration",
        "url": "https://github.com/quay/clair"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Application des seuils des constructions d'images Docker contenant des vulnérabilités",
    "priority": "Medium",
    "description": "Restreindre les builds avec des problèmes identifiés",
    "detail": "Utilisez un outil qui permet de restreindre les builds avec suffisamment de granularité pour ne pas interrompre le développement. Tous les CVE critiques ne sont pas les mêmes, donc être en mesure de restreindre les builds en fonction des vulnérabilités critiques ou élevées avec un correctif du fournisseur, mais permettant aux builds de continuer si cette vulnérabilité critique est 'open'",
    "documentation": [
      {
        "title": "Prisma Threshold enforcement",
        "url": "https://docs.paloaltonetworks.com/prisma/prisma-cloud/prisma-cloud-admin-compute/vulnerability_management/vuln_management_rules.html"
      },
      {
        "title": "StackRox Advanced Policy Enforcement",
        "url": "https://www.stackrox.com/use-cases/vulnerability-management/"
      },
      {
        "title": "AquaSec Proactive Risk Management",
        "url": "https://docs.aquasec.com/docs/proactive-risk-management"
      }
    ],
    "tags": ["all", "security"]
  },
  {
    "title": "Application de la conformité des builds d'images Docker",
    "priority": "High",
    "description": "Être capable d'évaluer et de restreindre l'état de conformité d'une image lors de la construction.",
    "detail": "Par exemple, dentifier une image exécutée en tant que 'root' avant son déploiement ou ouvrir le port 80 ou 22",
    "documentation": [
      {
        "title": "Azure Built-In Policy",
        "url": "https://docs.microsoft.com/en-us/azure/aks/policy-samples"
      },
      {
        "title": "Prisma Managing Compliance",
        "url": "https://docs.paloaltonetworks.com/prisma/prisma-cloud/prisma-cloud-admin-compute/compliance/manage_compliance.html"
      },
      {
        "title": "Aqua Image Assurance Policies",
        "url": "https://docs.aquasec.com/docs/image-assurance-policies-basic-info"
      },
      {
        "title": "StackRox Compliacne",
        "url": "https://www.stackrox.com/use-cases/compliance/"
      }
    ],
    "tags": ["all", "security"]
}
]