[
      {
        "title": "Activez la géoréplication de votre registre de containeurs",
        "priority": "Medium",
        "description": "Les entreprises qui souhaitent une présence locale ou une sauvegarde à chaud choisissent d’exécuter des services à partir de plusieurs régions Azure. ",
        "details": "La meilleure pratique recommandée consiste à placer un registre de conteneurs dans chaque région où les images sont exécutées afin de permettre des opérations à proximité du réseau pour des transferts de calque d’image rapides et fiables. La géoréplication permet à un registre de conteneurs Azure de fonctionner comme un registre unique desservant plusieurs régions à l’aide de registres régionaux à multiples maîtres.",
        "documentation": [
          {
            "title": "Géoréplication dans Azure Container Registry",
            "url": "https://docs.microsoft.com/fr-fr/azure/container-registry/container-registry-geo-replication"
          }
        ],
        "tags": ["all", "resiliency"]
      },
      {
        "title": "Gérez le trafic entrant",
        "priority": "Medium",
        "description": "Azure Traffic Manager peut diriger les clients vers leur cluster AKS et leur instance d’application les plus proches. Pour optimiser les performances et la redondance, faites transiter l’ensemble du trafic d’application par Traffic Manager avant qu’il parvienne à votre cluster AKS",
        "details": "Si vous possédez plusieurs clusters AKS dans différentes régions, utilisez Traffic Manager pour contrôler la façon dont le trafic afflue vers les applications qui s’exécutent dans chaque cluster. Azure Traffic Manager est un équilibreur de charge de trafic DNS qui peut répartir le trafic réseau entre les régions. Utilisez Traffic Manager pour router les utilisateurs selon le temps de réponse des clusters ou en fonction de critères géographiques.",
        "documentation": [
          {
            "title": "Utiliser Azure Traffic Manager pour router le trafic",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-multi-region#use-azure-traffic-manager-to-route-traffic"
          }
        ],
        "tags": ["all","network", "resiliency"]
      }
]
