[
    {
      "title": "Choisir le modèle réseau adapté",
      "priority": "Medium",
      "description": " Pour une intégration avec des réseaux virtuels existants ou des réseaux locaux, utilisez la mise en réseau Azure CNI dans AKS. Ce modèle réseau offre également une meilleure séparation des ressources et plus de contrôle dans un environnement d’entreprise",
      "detail": "L’interface Azure CNI est un protocole indépendant du fournisseur qui permet au runtime du conteneur d’adresser des demandes à un fournisseur de réseau. Elle affecte des adresses IP aux pods et aux nœuds et offre des fonctionnalités de Gestion des adresses IP (IPAM) pour la connexion à des réseaux virtuels Azure existants. Chaque ressource de type nœud ou pod reçoit une adresse IP dans le réseau virtuel Azure, sans qu’aucun routage supplémentaire soit nécessaire pour communiquer avec d’autres ressources ou services.",
      "documentation": [
        {
          "title": "Kubenet vs CNI",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-network#choose-the-appropriate-network-model"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "Plan IP addressing carefully",
      "priority": "Medium",
      "description": "La taille de votre réseau virtuel et de son sous-réseau doit être suffisante pour prendre en charge le nombre de pods que vous envisagez d’exécuter, ainsi que le nombre de nœuds du cluster.",
      "detail": "Par exemple, dans un mode CNI, vous devez avoir une IP pour chaque noeud, une IP de plus en cas de mise à jour d'un noeud, mais également une IP pour chaque pod, ce qui peut vite atteindre plusieurs centaines d'IP",
      "documentation": [
        {
          "title": "Plan IP addressing for your cluster",
          "url": "Planifier l’adressage IP pour votre cluster"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "Distribuer le trafic d’entrée",
      "priority": "Medium",
      "description": "Pour répartir le trafic HTTP ou HTTPS sur vos applications, utilisez des contrôleurs et des ressources d’entrée. Les contrôleurs d’entrée offrent des fonctionnalités supplémentaires par rapport à un équilibreur de charge Azure standard. Ils peuvent être gérés comme des ressources Kubernetes natives.",
      "documentation": [
        {
          "title": "Distribuer le trafic d’entrée",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-network#distribute-ingress-traffic"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "Sécuriser le trafic avec un pare-feu d’applications web (WAF)",
      "priority": "Medium",
      "description": "Pour analyser le risque d’attaques dans le trafic, utilisez un pare-feu d’applications web (WAF) comme Barracuda pour Azure ou Azure Application Gateway. Ces ressources réseau plus avancées peuvent également acheminer le trafic au-delà des connexions HTTP et HTTPS et de l’arrêt SSL de base.",
      "documentation": [
        {
          "title": "Sécuriser le trafic avec un pare-feu d’applications web (WAF)",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-network#secure-traffic-with-a-web-application-firewall-waf"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "N'exposez pas votre loadbalancer sur Internet si non nécessaireDon't expose your load-balancer on Internet if not necessary",
      "priority": "Medium",
      "description": "Il n'a que peu de raison d'exposer directement le point d'entrée de votre ingress controller directement sur Internet. Dites à AKS de créer un point d'entrée interne.",
      "documentation": [
        {
          "title": "Créer un contrôleur d’entrée pour un réseau virtuel interne",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/ingress-internal-ip"
        }
      ],
      "tags": ["all", "network", "security"]
    },
    {
      "title": "Contrôler le flux de trafic avec des stratégies réseau",
      "priority": "Medium",
      "description": "Utilisez des stratégies réseau pour autoriser ou refuser le trafic vers les pods. Par défaut, tout le trafic est autorisé entre les pods au sein d’un cluster. Pour une sécurité accrue, définissez des règles qui limitent la communication des pods.",
      "detail": "Network policy is a Kubernetes feature that lets you control the traffic flow between pods. You can choose to allow or deny traffic based on settings such as assigned labels, namespace, or traffic port. The use of network policies gives a cloud-native way to control the flow of traffic. As pods are dynamically created in an AKS cluster, the required network policies can be automatically applied. Don't use Azure network security groups to control pod-to-pod traffic, use network policies.",
      "documentation": [
        {
          "title": "Contrôler le flux de trafic avec des stratégies réseau",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-network#control-traffic-flow-with-network-policies"
        }
      ],
      "tools":[
        {
          "title": "Calico",
          "url": "https://docs.projectcalico.org/reference/resources/networkpolicy"
        },
        {
          "title": "Cillium",
          "url": "https://cilium.io/"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "Configurez des ^politiques réseau par défaut dans chaque espace de nom",
      "priority": "Medium",
      "description": "Commencez par créer des politiques réseau 'Deny All' dans chaque espace de nom, puis ajoutez les politiques réseau spécifiques dont ont besoin vos applications.",
      "documentation": [
        {
          "title": "Recettes des meilleurs politiques réseau par défaut",
          "url": "https://github.com/ahmetb/kubernetes-network-policy-recipes"
        }
      ],
      "tags": ["all", "network"]
    },
    {
      "title": "Protégez-vous du data-leaking avec l'egress lockdown",
      "priority": "Medium",
      "description": "Uitlisez Azure Firewall pour sécuriser et contrôler tout le traffic sortant de votre cluster.",
      "documentation": [
        {
          "title": "Contrôler le trafic de sortie pour les nœuds de cluster dans Azure Kubernetes Service",
          "url": "https://docs.microsoft.com/fr-fr/azure/aks/limit-egress-traffic"
        }
      ],
      "tags": ["all", "network", "security"]
    }
]