[
    {
        "title": "Gardez la version de kubernetes à jour",
        "priority": "Medium",
        "description": "Pour rester informé des nouvelles fonctionnalités et correctifs de bogues, effectuez des mises à jour régulières vers la version Kubernetes dans votre cluster AKS.",
        "documentation": [
          {
            "title": "Effectuer des mises à jour régulières vers la dernière version de Kubernetes",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-cluster-security#regularly-update-to-the-latest-version-of-kubernetes"
          }
        ],
        "tags": ["all", "operation", "security"]
    },
    {
        "title": "Gardez les nœuds à jour",
        "priority": "High",
        "description": "AKS prend en charge la mise à niveau des images sur un nœud afin que vous soyez à jour avec les dernières mises à jour du système d'exploitation et de l'exécution. AKS fournit une nouvelle image par semaine avec les dernières mises à jour, il est donc avantageux de mettre à jour régulièrement les images de votre nœud pour les dernières fonctionnalités, y compris les correctifs Linux ou Windows",
        "details": "L'utilisation de l'automatisation et de cette méthode garantira que tous vos nœuds sont constamment à jour avec les dernières fonctionnalités / correctifs / correctifs, sans avoir à mettre à niveau la version de kubernetes. Une alternative pourrait être d'utiliser Kured pour redémarrer les nœuds avec des redémarrages en attente, mais cela corrigera uniquement le système d'exploitation, pas la couche AKS",
        "documentation": [
          {
            "title": "Azure Kubernetes Service (AKS) node image upgrades",
            "url": "https://docs.microsoft.com/en-us/azure/aks/node-image-upgrade"
          },
          {
            "title": "Process Linux node updates and reboots using Kured",
            "url": "https://docs.microsoft.com/en-us/azure/aks/operator-best-practices-cluster-security#process-linux-node-updates-and-reboots-using-kured"
          }
        ],
        "tools":[
          {
            "title": "Kured (KUbernetes REboot Daemon)",
            "url": "https://github.com/weaveworks/kured"
          }
        ],
        "tags": ["all", "operation", "security", "windows"]
    },
    {
        "title": "Se connecter en toute sécurité aux nœuds à travers un hôte bastion",
        "priority": "Medium",
        "description": "N’exposez pas de connectivité à distance sur vos nœuds AKS. Créez un hôte bastion, ou une jumpbox, dans un réseau virtuel de gestion. Utilisez l’hôte bastion pour acheminer le trafic en toute sécurité dans votre cluster AKS aux tâches de gestion à distance.",
        "detail": "",
        "documentation": [
          {
            "title": "Se connecter en toute sécurité aux nœuds à travers un hôte bastion",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-network#securely-connect-to-nodes-through-a-bastion-host"
          }
        ],
        "tags": ["all", "operation", "security"]
    },
    {
        "title": "Rechercher régulièrement les problèmes liés au cluster",
        "priority": "Medium",
        "description": "Exécutez régulièrement la dernière version de l’outil open source kube-advisor pour détecter les problèmes dans votre cluster. Si vous appliquez des quotas de ressources sur un cluster AKS existant, exécutez d’abord kube-advisor pour rechercher les pods dont les demandes et limites de ressources ne sont pas définies.",
        "details": "L’outil kube-advisor est un projet open source AKS associé qui analyse un cluster Kubernetes et signale les problèmes trouvés. Une vérification utile consiste à identifier les pods dépourvus de demandes et de limites de ressources.",
        "documentation": [
          {
            "title": "Rechercher régulièrement les problèmes liés au cluster avec kube-advisor",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-scheduler#regularly-check-for-cluster-issues-with-kube-advisor"
          }
        ],
        "tools":[
          {
            "title": "Kube-advisor",
            "url": "https://github.com/azure/kube-advisor"
          },
          {
            "title": "Kube-advisor par Alcide.io",
            "url": "https://www.alcide.io/kubernetes-advisor"
          }
        ],
        "tags": ["all", "operation"]
    },
    {
      "title": "Surveillez la sécurité de votre cluster avec Azure Security Center",
      "priority": "Medium",
      "description": "Security Center apporte les avantages d'une sécurité à vos clusters AKS, en utilisant les données capturées par le noeud master.",
      "documentation": [
        {
          "title": "Azure Kubernetes Services integration with Security Center",
          "url": "https://docs.microsoft.com/en-us/azure/security-center/azure-kubernetes-service-integration"
        }
      ],
      "tags": ["all", "operation"]
    },
    {
      "title": "Monitorez votre cluster",
      "priority": "High",
      "description": "Surveillez votre cluster, à l'aide d'outils pour vous assurez la bonne santé de vos clusters, noeuds et pods",
      "documentation": [
        {
          "title": "Azure Monitor pour AKS",
          "url": "https://docs.microsoft.com/fr-fr/azure/azure-monitor/insights/container-insights-analyze"
        }
      ],
      "tools":[
        {
          "title": "Elastic Cloud",
          "url": "https://www.elastic.co/elastic-cloud-kubernetes"
        },
        {
          "title": "Datadog",
          "url": "https://www.datadoghq.com/"
        }
      ],
      "tags": ["all", "operation"]
    },
    {
      "title": "Enable master node logs",
      "priority": "High",
      "description": "To help troubleshoot your application and services, you may need to view the logs generated by the master components. Be aware that if you don't enable these logs, there is no way for Microsoft to retrieve them for you",
      "documentation": [
        {
          "title": "Enable and review Kubernetes master node logs",
          "url": "https://docs.microsoft.com/en-us/azure/aks/view-master-logs"
        }
      ],
      "tags": ["all", "operation", "security"]
    },
    {
      "title": "Collectez les métriques",
      "priority": "High",
      "description": "Si l'intégration par défaut peut collecter des données de télémétrie et des métriques de base (CPU / mémoire), elles ne collectent pas de métriques personnalisées et d'informations plus détaillées. Il est souvent nécessaire d'installer un logiciel tiers (prometheus est recommandé dans Kubernetes) et ils stockent ces métriques pour les exploiter.",
      "details": "En règle générale, pour utiliser Prometheus, vous devez configurer et gérer un serveur Prometheus avec un magasin. En s'intégrant à Azure Monitor, un serveur Prometheus n'est pas requis. Il vous suffit d'exposer le point de terminaison des métriques Prometheus via vos exportateurs ou pods (application), et l'agent conteneurisé pour Azure Monitor pour les conteneurs peut supprimer les métriques pour vous.",
      "documentation": [
        {
          "title": "Configure scraping of Prometheus metrics",
          "url": "https://docs.microsoft.com/en-us/azure/azure-monitor/insights/container-insights-prometheus-integration"
        },
        {
          "title": "Deploying ELK",
          "url": "https://www.elastic.co/guide/en/cloud-on-k8s/current/k8s-quickstart.html"
        }
      ],
      "tags": ["all", "operation"]
    },
    {
      "title": "Configurer le traçage distribué",
      "priority": "Low",
      "description": "Le traçage distribué, également appelé traçage de demande distribué, est une méthode utilisée pour profiler et surveiller les applications, en particulier celles créées à l'aide d'une architecture de microservices. Le traçage distribué permet de localiser les pannes et les causes de mauvaises performances.",
      "documentation": [
        {
          "title": "Solution for onboarding Kubernetes/AKS workloads onto Application Insights monitoring.",
          "url": "https://github.com/microsoft/Application-Insights-K8s-Codeless-Attach"
        },
        {
          "title": "Zero instrumentation application monitoring for Kubernetes hosted applications (deprecated)",
          "url": "https://docs.microsoft.com/en-us/azure/azure-monitor/app/kubernetes"
        }
      ],
      "tags": ["all", "operation"]
    },
    {
      "title": "Contrôlez la conformité avec des stratégies de sécurité",
      "priority": "Medium",
      "description": "La stratégie Azure s'intègre au service Azure Kubernetes (AKS) pour appliquer des mises en œuvre et des protections à l'échelle sur vos clusters de manière centralisée et cohérente.",
      "documentation": [
        {
          "title": "Azure Policies for AKS",
          "url": "https://docs.microsoft.com/en-us/azure/governance/policy/concepts/rego-for-aks"
        }
      ],
      "tools":[
        {
          "title": "Gatekeeper",
          "url": "https://github.com/open-policy-agent/gatekeeper"
        }
      ],
      "tags": ["all", "operation"]
    }
]

