[
  {
    "title": "Le choix du type de stockage adapté",
    "priority": "High",
    "description": "Identifiez les besoins de votre application pour choisir le stockage approprié. Utilisez un stockage sur disque SSD haute performance pour les charges de travail de production. Optez pour un stockage basé sur un réseau si vous avez besoin de multiples connexions simultanées.",
    "documentation": [
      {
        "title": "Le choix du type de stockage adapté",
        "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-storage#choose-the-appropriate-storage-type"
      }
    ],
    "tags": ["all", "storage"]
  },
    {
        "title": "Dimensionner les noeuds en fonction des besoins de stockage",
        "priority": "Medium",
        "description": "chaque taille de nœud prend en charge un nombre maximal de disques. Différentes tailles de nœud fournissent également des quantités différentes de stockage local et de bande passante de réseau. Planifiez les exigences de votre application pour déployer la taille appropriée de nœuds.",
        "documentation": [
          {
            "title": "Dimensionner les nœuds en fonction des besoins de stockage",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-storage#size-the-nodes-for-storage-needs"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Approvisionner les volumes de manière dynamique",
        "priority": "Low",
        "description": "Afin de réduire les frais de gestion et de vous permettre d’ajuster votre utilisation, ne créez et n’affectez pas de volumes persistants de manière statique. Optez pour un approvisionnement dynamique",
        "documentation": [
          {
            "title": "Approvisionner les volumes de manière dynamique",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-storage#dynamically-provision-volumes"
          }
        ],
        "tags": ["all", "storage"]
      },
      {
        "title": "Sécuriser et sauvegarder vos données",
        "priority": "Medium",
        "description": "Sauvegardez vos données à l’aide d’un outil adapté à votre type de stockage, tel que Velero ou Azure Site Recovery. Vérifiez l’intégrité et la sécurité de ces sauvegardes.",
        "detail": "Identifiez les limitations des différentes approches en matière de sauvegarde de données et déterminez si vous devez suspendre vos données avant la capture instantanée. Les sauvegardes de données ne vous permettent pas nécessairement de restaurer votre environnement d’application de déploiement de cluster.",
        "documentation": [
          {
            "title": "Sécuriser et sauvegarder vos données",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-storage#secure-and-back-up-your-data"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      },
      {
        "title": "Rendez votre stockage résilient",
        "priority": "High",
        "description": "Dans la mesure du possible, ne stockez pas l’état du service dans le conteneur. Au lieu de cela, utilisez une plateforme Azure en tant que service (PaaS) qui prend en charge la réplication multirégion.",
        "detail": "état du service correspond aux données en mémoire ou sur disque nécessaires au bon fonctionnement du service. L’état comprend des variables membres et des structures de données que le service lit et écrit. Selon l’architecture du service, l’état peut aussi inclure des fichiers ou d’autres ressources stockés sur le disque, par exemple, les fichiers qu’utilise une base de données pour stocker les journaux de données et de transactions.",
        "documentation": [
          {
            "title": "Supprimer l’état du service des conteneurs",
            "url": "https://docs.microsoft.com/fr-fr/azure/aks/operator-best-practices-multi-region#remove-service-state-from-inside-containers"
          }
        ],
        "tags": ["all", "storage", "resiliency"]
      }
]